Repository: DEFRA/epr-frontend-accountcreation-microservice
Catalog: src/FrontendAccountCreation.Web/Resources/Views/ApprovedPerson/NonCompaniesHouseTeamMemberDetails.*.resx
Languages: cy

# TeamMemberDetails.Email
source: Email
cy: Ebost

# TeamMemberDetails.FirstName
source: First name
cy: Enw cyntaf

# TeamMemberDetails.FirstNameErrorMessage
source: Enter their first name
cy: Rhowch eu henw cyntaf nhw

# TeamMemberDetails.FirstNameLengthErrorMessage
source: First name must be 50 characters or less
cy: Rhaid i’r enw cyntaf fod yn 50 neu lai o gymeriadau

# TeamMemberDetails.Header
source: What are their details?
cy: Beth yw eu manylion nhw?

# TeamMemberDetails.HintEmail
source: We ask for this so we can invite them to join your team.
cy: Rydyn ni'n gofyn am hyn fel y gallwn eu gwahodd nhw i ymuno â'ch tîm.

# TeamMemberDetails.HintTelephone
source: We ask for this in case your regulator needs to call them directly with any queries.
cy: Rydyn ni'n gofyn am hyn rhag ofn bod angen i'ch rheoleiddiwr eu ffonio'n uniongyrchol gydag unrhyw ymholiadau.

# TeamMemberDetails.LastName
source: Last name
cy: Enw Olaf

# TeamMemberDetails.LastNameErrorMessage
source: Enter their last name
cy: Rhowch eu henw olaf nhw

# TeamMemberDetails.LastNameLengthErrorMessage
source: Last name must be 50 characters or less
cy: Rhaid i’r enw olaf fod yn 50 neu lai o gymeriadau

# TeamMemberDetails.Telephone
source: Telephone
cy: Ffôn

# TeamMemberDetails.Title
source: What are their details?
cy: [Welsh]What are their details?

# TeamMemberDetails.TelephoneNumberEmptyErrorMessage
source: Enter a telephone number
cy: Rhowch rif ffôn

# TeamMemberDetails.TelephoneNumberInvalidErrorMessage
source: Enter a valid telephone number, like 01642 123 456, 07777 777 777 or +33 1 23 45 67 88
cy: Rhowch rif ffôn dilys, fel 01642 123 456, 07777 777 777 neu +33 1 23 45 67 88

# TeamMemberDetails.EmailEmptyErrorMessage
source: Enter their email address
cy: Rhowch eu cyfeiriad ebost nhw

# TelephoneNumber.TelephoneNumberErrorMessage
source: Enter a valid telephone number
cy: Rhowch rif ffôn dilys

# TeamMemberDetails.EmailInvalidErrorMessage
source: Enter an email address with a name, @ symbol and a domain name, like yourname@example.com
cy: Rhowch gyfeiriad ebost gydag enw, y symbol @ ac enw parth, fel eichenwchi@enghraifft.com

# TeamMemberDetails.NonUk.Question
source: What are your team member's details?
cy: [Welsh]What are your team member's details?

# NonCompaniesHouseTeamMemberDetails.Title
source: What are their details?
cy: [Welsh]What are their details?
