Repository: DEFRA/epr-frontend-accountcreation-microservice
Catalog: src/FrontendAccountCreation.Web/ResourcesRegulator/Views/AccountCreation/CheckYourDetails.*.resx
Languages: cy

# CheckYourDetails.Title
source: Your details
cy: WYour details

# CheckYourDetails.Header
source: Check your details
cy: WCheck your details

# CheckYourDetails.YourOrganisation
source: Your organisation
cy: WYour organisation

# CheckYourDetails.OrganisationType
source: Type of organisation
cy: WType of organisation

# CheckYourDetails.CompaniesHouseNumber
source: Companies House number
cy: WCompanies House number

# CheckYourDetails.OrganisationDetails
source: Organisation details
cy: WOrganisation details

# CheckYourDetails.TradingName
source: Trading name
cy: WTrading name

# CheckYourDetails.Address
source: Address
cy: WAddress

# CheckYourDetails.WrongAddressAmendPrompt
source: If the address is wrong, you’ll need to
cy: WIf the address is wrong, you’ll need to

# CheckYourDetails.WrongAddressAmend.LinkDescription
source: change it on Companies House (opens in a new tab)
cy: Wchange it on Companies House (opens in a new tab)

# CheckYourDetails.YourSelf
source: You
cy: WYou

# CheckYourDetails.YourRole
source: Role
cy: WRole

# CheckYourDetails.YourName
source: Name
cy: WName

# CheckYourDetails.YourTelephone
source: Telephone
cy: WTelephone

# CheckYourDetails.NonUkOrganisation
source: Non-UK organisation
cy: WNon-UK organisation

# CheckYourDetails.Partnership
source: Partnership
cy: WPartnership

# CheckYourDetails.SoleTrader
source: Sole trader
cy: WSole trader

# CheckYourDetails.UnincorporatedBody
source: Unincorporated body
cy: WUnincorporated body

# CheckYourDetails.Other
source: Other
cy: WOther

# CheckYourDetails.Director
source: Director
cy: WDirector

# CheckYourDetails.CompanySecretary
source: Company secretary
cy: WCompany secretary

# CheckYourDetails.Partner
source: Partner
cy: WPartner

# CheckYourDetails.Member
source: Member
cy: WMember

# CheckYourDetails.England
source: England
cy: WEngland

# CheckYourDetails.NorthernIreland
source: Northern Ireland
cy: WNorthern Ireland

# CheckYourDetails.Scotland
source: Scotland
cy: WScotland

# CheckYourDetails.UkNation
source: UK nation
cy: WUK nation

# CheckYourDetails.Wales
source: Wales
cy: WWales

# CheckYourDetails.RegisteredCharity
source: A registered charity?
cy: WA registered charity?

# CheckYourDetails.RegisteredWithCompaniesHouse
source: Registered with Companies House?
cy: WRegistered with Companies House?

# CheckYourDetails.Role
source: Role
cy: WRole
