Repository: DEFRA/epr-frontend-accountcreation-microservice
Catalog: src/FrontendAccountCreation.Web/Resources/Views/LimitedPartnership/NamesOfPartners.*.resx
Languages: cy

# NamesOfPartners.Title_Individual
source: Name Individual Partners
cy: [Welsh]Name Corporate Partners

# NamesOfPartners.Title_Company
source: Name Corporate Partners
cy: [Welsh]Name Company Partners

# NamesOfPartners.Title_Both
source: Name All Partners
cy: [Welsh]Name All Partners

# NamesOfPartners.H1_Individual
source: What are the names of all individual partners in your limited partnership?
cy: [Welsh]What are the names of all corporate partners in your limited partnership?

# NamesOfPartners.H1_Company
source: What are the names of corporate partners in your limited partnership?
cy: [Welsh]What are the names of company partners in your limited partnership?

# NamesOfPartners.H1_Both
source: What are the names of all partners in your limited partnership?
cy: [Welsh]What are the names of all partners in your limited partnership?

# NamesOfPartners.Hint_Individual
source: This means individual partners, who are listed as partners within your limited partnership, as registered on Companies House.
cy: [Welsh]This means corporate partners, who are listed as partners within your limited partnership, as registered on Companies House.

# NamesOfPartners.Hint_Company
source: This means any corporate partners which are listed as partners within your limited partnership, as registered on Companies House.
cy: [Welsh]This means any company entity partners within your limited partnership, as registered on Companies House.

# NamesOfPartners.Hint_Both
source: This means any comrporate partners and individual partners, which are listed as partners within your limited partnership, as registered on Companies House.
cy: [Welsh]This means any company entity partners and corporate partners, which are listed as partners within your limited partnership, as registered on Companies House.

# NamesOfPartners.CompanyName
source: Corporate partner name
cy: [Welsh]Company partner name

# NamesOfPartners.Or
source: Or
cy: [Welsh]Or

# NamesOfPartners.AddAnotherPartner
source: Add another partner
cy: [Welsh]Add another partner

# NamesOfPartners.ValidationError_Individual
source: Enter the full name of an individual partner
cy: [Welsh]Enter the full name of an corporate partner

# NamesOfPartners.ValidationError_Company
source: Enter a corporate partner name
cy: [Welsh]Enter a company partner name

# NamesOfPartners.ValidationError_Both
source: Enter a corporate partner name or the full name of an individual partner
cy: [Welsh]Enter a company partner name or the full name of an corporate partner
