Repository: DEFRA/epr-frontend-accountcreation-microservice
Catalog: src/FrontendAccountCreation.Web/Resources/Views/LimitedPartnership/NonCompaniesHousePartnershipNamesOfPartners.*.resx
Languages: cy

# NonCompaniesHousePartnershipNamesOfPartners.Title_Individual
source: What are the names of all individual partners in your partnership?
cy: [Welsh]Name Individual Partners

# NonCompaniesHousePartnershipNamesOfPartners.Title_Company
source: What are the names of corporate partners in your partnership?
cy: [Welsh]Name Corporate Partners

# NonCompaniesHousePartnershipNamesOfPartners.Title_Both
source: What are the names of all partners in your partnership?
cy: [Welsh]Name-All-Partners

# NonCompaniesHousePartnershipNamesOfPartners.H1_Individual
source: What are the names of all individual partners in your partnership?
cy: [Welsh]What are the names of all individual partners in your partnership?

# NonCompaniesHousePartnershipNamesOfPartners.H1_Company
source: What are the names of corporate partners in your partnership?
cy: [Welsh]What are the names of corporate partners in your partnership?

# NonCompaniesHousePartnershipNamesOfPartners.H1_Both
source: What are the names of all partners in your partnership?
cy: [Welsh]What are the names of all partners in your partnership?

# NonCompaniesHousePartnershipNamesOfPartners.Hint_Individual
source: This means individual partners, who are listed as partners within your partnership.
cy: [Welsh]This means individual partners, who are listed as partners within your partnership.

# NonCompaniesHousePartnershipNamesOfPartners.Hint_Company
source: This means any corporate partners which are listed as partners within your partnership.
cy: [Welsh]This means any corporate partners which are listed as partners within your partnership.

# NonCompaniesHousePartnershipNamesOfPartners.Hint_Both
source: This means any corporate partners and individual partners, which are listed as partners within your partnership.
cy: [Welsh]This means any corporate partners and individual partners, which are listed as partners within your partnership.

# NonCompaniesHousePartnershipNamesOfPartners.AddAnotherPartner
source: Add another partner
cy: [Welsh]Add another partner

# NonCompaniesHousePartnershipNamesOfPartners.ValidationError_Individual
source: Enter the full name of an individual partner
cy: [Welsh]Enter the full name of an individual partner

# NonCompaniesHousePartnershipNamesOfPartners.ValidationError_Company
source: Enter a corporate partner name
cy: [Welsh]Enter a corporate partner name

# NonCompaniesHousePartnershipNamesOfPartners.ValidationError_Both
source: Enter a corporate partner name or the full name of an individual partner
cy: [Welsh]Enter a corporate partner name or the full name of an individual partner
