Repository: DEFRA/epr-frontend-accountcreation-microservice
Catalog: src/FrontendAccountCreation.Web/ResourcesRegulator/Views/Accessibility/Detail.*.resx
Languages: cy

# Accessibility.Call
source: call 03459 33 55 77 (Monday to Friday, 8.30pm to 5pm)
cy: wcall 03459 33 55 77 (Monday to Friday, 8.30pm to 5pm)

# Accessibility.ChangeColours
source: change colours, contrast levels and fonts
cy: wchange colours, contrast levels and fonts

# Accessibility.ComplianceStatus
source: Compliance status
cy: wCompliance status

# Accessibility.ContactingUs
source: Contacting us by phone or visiting us in person
cy: wContacting us by phone or visiting us in person

# Accessibility.ContactUs
source: contact us
cy: wcontact us

# Accessibility.DefraIsCommitted
source: Defra is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.
cy: wDefra is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.

# Accessibility.Email
source: email
cy: wemail

# Accessibility.EnforcementProcedure
source: Enforcement procedure
cy: wEnforcement procedure

# Accessibility.EqualityAdvisorySupportService
source: contact the Equality Advisory and Support Service (EASS)
cy: wcontact the Equality Advisory and Support Service (EASS)

# Accessibility.FeedbackAndContact
source: Feedback and contact information
cy: wFeedback and contact information

# Accessibility.FindOutHowTo
source: Find out how to
cy: wFind out how to

# Accessibility.HasAdviceOn
source: has advice on making your device easier to use if you have a disability.
cy: whas advice on making your device easier to use if you have a disability.

# Accessibility.HowAccessible
source: How accessible this website is
cy: wHow accessible this website is

# Accessibility.IfYouAreNotHappy
source: If you’re not happy with how we respond to your complaint
cy: wIf you’re not happy with how we respond to your complaint

# Accessibility.IfYouNeedInformation
source: If you need information on this website in a different format like an accessible PDF, large print, easy read, audio recording or braille:
cy: wIf you need information on this website in a different format like an accessible PDF, large print, easy read, audio recording or braille:

# Accessibility.LastReviewed
source: It was last reviewed on
cy: wIt was last reviewed on

# Accessibility.NavigateUsingKeyboard
source: navigate most of the website using just a keyboard
cy: wnavigate most of the website using just a keyboard

# Accessibility.NavigateUsingReader
source: listen to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: wlisten to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)

# Accessibility.NavigateUsingSpeech
source: navigate most of the website using speech recognition software
cy: wnavigate most of the website using speech recognition software

# Accessibility.OurOfficesHaveAudio
source: Our offices have audio induction loops, or if you contact us before your visit we can arrange a British Sign Language (BSL) interpreter.
cy: wOur offices have audio induction loops, or if you contact us before your visit we can arrange a British Sign Language (BSL) interpreter.

# Accessibility.PreparationOfThis
source: Preparation of this accessibility statement
cy: wPreparation of this accessibility statement

# Accessibility.ReportingProblems
source: Reporting accessibility problems with this website
cy: wReporting accessibility problems with this website

# Accessibility.TechnicalInformation
source: Technical information about this website’s accessibility
cy: wTechnical information about this website’s accessibility

# Accessibility.TheEqualityAndHumanRights
source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No.2) Accessibility Regulations 2018 (the ‘accessibility regulations’).
cy: wThe Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No.2) Accessibility Regulations 2018 (the ‘accessibility regulations’).

# Accessibility.TheTestWasCarriedOut
source: The test was carried out internally using WAVE, a web accessibility evaluation tool.
cy: wThe test was carried out internally using WAVE, a web accessibility evaluation tool.

# Accessibility.ThisAccessibilityStatement
source: This accessibility statement applies to the ‘Report packaging data’ service.
cy: wThis accessibility statement applies to the ‘Report packaging data’ service.

# Accessibility.ThisStatementWasPrepared
source: This statement was prepared on
cy: wThis statement was prepared on

# Accessibility.ThisWebsiteIsFully
source: This website is fully compliant with the
cy: wThis website is fully compliant with the

# Accessibility.ThisWebsiteIsRun
source: This website is run by the Department for Environment, Food and Rural Affairs (Defra).
cy: wThis website is run by the Department for Environment, Food and Rural Affairs (Defra).

# Accessibility.ThisWebsiteWas
source: This website was last tested on
cy: wThis website was last tested on

# Accessibility.Title
source: Accessibility statement for ‘Report packaging data’
cy: wAccessibility statement for ‘Report packaging data’

# Accessibility.WebContentAccessibility
source: Web Content Accessibility Guidelines version 2.1 AA standard
cy: wWeb Content Accessibility Guidelines version 2.1 AA standard

# Accessibility.WeDontThink
source: We don’t think there are any accessibility issues with this website.
cy: wWe don’t think there are any accessibility issues with this website.

# Accessibility.WeProvideAText
source: We provide a text relay service for people who are D/deaf, hearing impaired or have a speech impediment.
cy: wWe provide a text relay service for people who are D/deaf, hearing impaired or have a speech impediment.

# Accessibility.WereAlwaysLooking
source: We’re always looking to improve the accessibility of this website. If you find any problems not listed on this page or think we’re not meeting accessibility requirements, contact:
cy: wWe’re always looking to improve the accessibility of this website. If you find any problems not listed on this page or think we’re not meeting accessibility requirements, contact:

# Accessibility.WeveAlsoMade
source: We’ve also made the website text as simple as possible to understand.
cy: wWe’ve also made the website text as simple as possible to understand.

# Accessibility.WeWantAsMany
source: We want as many people as possible to be able to use this website. For example, that means that you should be able to:
cy: wWe want as many people as possible to be able to use this website. For example, that means that you should be able to:

# Accessibility.ZoomIn
source: zoom in up to 400% without the text spilling off the screen
cy: wzoom in up to 400% without the text spilling off the screen
