Repository: DEFRA/epr-frontend-accountcreation-microservice
Catalog: src/FrontendAccountCreation.Web/Resources/SharedResources.*.resx
Languages: cy

source: Back
cy: Yn ôl

source: Continue
cy: Parhau

source: Skip to main content
cy: WSkip to main content

# ApplicationTitle
source: Report packaging data
cy: Rhoi gwybodaeth am ddata pecynwaith

source: No
cy: Nac ydy

source: Yes
cy: Ydy

source: Change
cy: Newid

source: or
cy: neu

# Header.SignIn
source: Sign in
cy: Mewngofnodi

# Header.SignOut
source: Sign out
cy: Allgofnodi

# EprForPackaging
source: EPR for packaging: reprocessors and exporters
cy: EPR dros becynwaith: ailbroseswyr ac allforwyr

source: Company secretary
cy: Ysgrifennydd y cwmni

source: Director
cy: Cyfarwyddwr

source: Remove
cy: [Welsh]Remove

source: Individual Partner
cy: Partner unigol

source: None of the above
cy: Dim un o’r uchod

# PartnerCompanySecretary
source: Company secretary of a corporate partner
cy: [Welsh]Company secretary of a corporate partner

# PartnerDirector
source: Company director of a corporate partner
cy: [Welsh]Company director of a corporate partner

source: Member
cy: [Welsh]Member

source: Not sure
cy: Ddim yn siŵr

# CEO
source: Chief Executive Officer
cy: Prif Swyddog Gweithredol

source: Company Director or Secretary
cy: Cyfarwyddwr neu Ysgrifennydd y Cwmni

source: For example:
cy: Er enghraifft:

source: chairperson
cy: W chairperson

source: treasurer
cy: W treasurer

source: secretary
cy: W secretary

source: manager
cy: W manager
